Make a virtual environment in the dir below, and then activate it:

`python -m venv /path/env_de_zoomcamp`

`source /path/env_de_zoomcamp/bin/activate`

In [ ]:
! pip install sqlalchemy psycopg2-binary pandas

In [18]:
import pandas as pd
from sqlalchemy import create_engine
import numpy as np

In [8]:
engine = create_engine("postgresql://postgres:postgres@localhost:5432/ny_taxi") 
# postgresql://[postgres_user]:[postgres_pass]@localhost:[postgres_port]/[dbname]
engine.connect()

In [37]:
df = pd.read_csv('green_tripdata_2019-10.csv')

/var/folders/zt/2wspspzx42j9xrz5qc4g8cyh0000gn/T/ipykernel_55351/2156106363.py:1: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv('green_tripdata_2019-10.csv')

In [38]:
df.to_sql(name='green_tripdata_2019_10',con=engine,index=False)

386

Table CANNOT have "-" in the name! to delete this, must go to the docker container and run within the container:

`DO $$ DECLARE
    r RECORD;
BEGIN
    FOR r IN (SELECT tablename FROM pg_tables WHERE schemaname = 'public') LOOP
        EXECUTE 'DROP TABLE IF EXISTS "' || r.tablename || '" CASCADE';
    END LOOP;
END $$;`

In [39]:
# query template using Pandas and SQLAlchemy for a SQL DB
query = """
SELECT *
FROM pg_catalog.pg_tables
WHERE schemaname != 'pg_catalog' AND 
    schemaname != 'information_schema';
"""
pd.read_sql(query,con=engine)

,schemaname,tablename,tableowner,tablespace,hasindexes,hasrules,hastriggers,rowsecurity
0,public,green_tripdata_2019_10,postgres,None,False,False,False,False

In [81]:
# query template using Pandas and SQLAlchemy for a SQL DB
query = """
SELECT
    column_name,
    data_type
FROM
    information_schema.columns
WHERE
    table_name = 'green_tripdata_2019_10';
"""
pd.read_sql(query,con=engine) 
# datetime shows data_type text. this should not be happening, but sqlalchemy does not support alter table. shitty package.

              column_name         data_type
0    congestion_surcharge  double precision
1            payment_type  double precision
2               trip_type  double precision
3                VendorID  double precision
4              RatecodeID  double precision
5            PULocationID            bigint
6            DOLocationID            bigint
7         passenger_count  double precision
8           trip_distance  double precision
9             fare_amount  double precision
10                  extra  double precision
11                mta_tax  double precision
12             tip_amount  double precision
13           tolls_amount  double precision
14              ehail_fee  double precision
15  improvement_surcharge  double precision
16           total_amount  double precision
17   lpep_pickup_datetime              text
18  lpep_dropoff_datetime              text
19     store_and_fwd_flag              text

In [68]:
# Question 3, Homework 1
# query template using Pandas and SQLAlchemy for a SQL DB
query = """
with trip_cte as
(
    select 
        trip_distance, 
        CASE 
            WHEN trip_distance < 1 THEN 'Up to 1 mile'
            WHEN trip_distance >= 1 AND trip_distance < 3 THEN 'In between 1 (exclusive) and 3 miles (inclusive)'
            WHEN trip_distance >= 3 AND trip_distance < 7 THEN 'In between 3 (exclusive) and 7 miles (inclusive)'
            WHEN trip_distance >= 7 AND trip_distance < 10 THEN 'In between 7 (exclusive) and 10 miles (inclusive)'
            ELSE 'Over 10 miles'
        END as trip_bin
    from green_tripdata_2019_10
    where lpep_pickup_datetime::timestamp >= '2019-10-01' and lpep_dropoff_datetime::timestamp < '2019-11-01'
)
select trip_bin, count(trip_bin) from trip_cte
group by trip_bin;
"""
pd.read_sql(query,con=engine)
# answer is consistent with the 104,793; 201,407; 110,612; 27,831; 35,281 answer, even though the "up to 1 mile" answer is different.

                                            trip_bin   count
0   In between 1 (exclusive) and 3 miles (inclusive)  201407
1   In between 3 (exclusive) and 7 miles (inclusive)  110612
2  In between 7 (exclusive) and 10 miles (inclusive)   27831
3                                      Over 10 miles   35281
4                                       Up to 1 mile  101065

In [78]:
# Question 4, Homework 1
query = """
with longest_trip_day as 
(
    select date_trunc('day',lpep_pickup_datetime::timestamp)::date as pickup_day, max(trip_distance) as longest_trip
    from green_tripdata_2019_10
    group by date_trunc('day',lpep_pickup_datetime::timestamp)::date
)
select * from longest_trip_day
order by longest_trip desc
limit 1;
"""
pd.read_sql(query,con=engine)

   pickup_day  longest_trip
0  2019-10-31        515.89

In [ ]:
# Question 5, Homework 1
# there are no direct place, have to get the info from somewhere outside the csv.
query = """
with pickup_location_total as 
(
    select sum(total_amount), "PULocationID"
    from green_tripdata_2019_10
    where date_trunc('day',lpep_pickup_datetime::timestamp)::date = '2019-10-18'
    group by "PULocationID"
    having sum(total_amount)>13000
)
select * from pickup_location_total;
"""
pd.read_sql(query,con=engine)
# PULocationID-s: 74, 75, 166.

        sum  PULocationID
0  18686.68            74
1  16797.26            75
2  13029.79           166

In [91]:
# Question 6, Homework 1
# From Question 5, East Harlem North is ID 74.
query = """
with largest_tip_pickup as
(
    select max(tip_amount) as largest_tip, "DOLocationID"
    from green_tripdata_2019_10
    where "PULocationID"=74 and date_trunc('month',lpep_pickup_datetime::timestamp)::date = '2019-10-01'
    group by "DOLocationID"
)
select * from largest_tip_pickup
order by largest_tip desc
limit 1;
"""
pd.read_sql(query,con=engine)
# location ID 132 is JFK Airport.

   largest_tip  DOLocationID
0         87.3           132